{
	"mainPageUrl": "http://localhost:8080/cliparchive",
	"subPageUrls": [
		"http://localhost:8080/cliparchive/#/login",
		"http://localhost:8080/cliparchive/#/dashboard",
		"http://localhost:8080/cliparchive/#/clip-requests",
		"http://localhost:8080/cliparchive/#/video-history",
		"http://localhost:8080/cliparchive/#/video-detail/gjuwy-bjdeyy-xivbo",
		"http://localhost:8080/cliparchive/#/remote-sites",
		"http://localhost:8080/cliparchive/#/admin/health-notifications",
		"http://localhost:8080/cliparchive/#/admin/settings",
		"http://localhost:8080/cliparchive/#/invalid-page-to-check-not-found"
	],
	"pages": [
		{
			"url": "http://localhost:8080/cliparchive/#/login",
			"features": "Login Page for ClipArchive. User interaction steps: 1. Locate the username input field and type 'test'. 2. Locate the password input field and type 'test1234'. 3. Click the 'Login' or 'Sign In' button to submit the form. If there is a 'Remember me' checkbox, it can be optionally checked. After successful login, user will be redirected to the dashboard."
		},
		{
			"url": "http://localhost:8080/cliparchive/#/dashboard",
			"features": "Dashboard page with two sections: side menu and main content. User interactions: 1. Create a new clip request: Click the 'Clip Setup' button located at the top left corner above the side menu. This opens a modal dialog. In the modal, fill in the form fields: select site name (e.g., BUS1024) from dropdown, enter requester name in text input, select or enter 'Clip from time' (e.g., November 18, 2025, 1:30 PM), select or enter 'Clip to time', optionally add description, then click 'Submit' or 'Create' button to create the clip request. Click 'Cancel' to close the modal without saving. 2. View sites table: The main content area displays a table showing Site Name, Last communication time, and Pending clip requests columns. User can click on any site row to view details. 3. Switch views: Click the top right tabs (e.g., 'Table' and 'Charts') to toggle between table view and chart view of the data. 4. Side menu navigation: Click any menu item in the side menu to navigate to different pages."
		},
		{
			"url": "http://localhost:8080/cliparchive/#/clip-requests",
			"features": "Clip requests table page with pagination and filters. User interactions: 1. Apply filters: Click the filter icon (funnel icon) located above the table. This opens a filter modal or panel. In the filter modal, select filter category tabs: 'Clip Info', 'Time', or 'Status'. For Clip Info category: enter site name in text input, enter requester name in text input. For Time category: select date range using date pickers for 'from' and 'to' dates, or enter specific times. For Status category: select status from dropdown (e.g., pending, completed, failed) or checkboxes. Click 'Apply Filters' button to apply, or 'Clear' to reset all filters, or 'Close' to cancel. 2. Sort columns: Click on any column header (Site Name, Requester Name, Clip From Time, Clip To Time, Status) to sort the table. Click once for ascending, click again for descending. 3. Pagination: Click page numbers at the bottom of the table, or use 'Previous'/'Next' buttons to navigate between pages. Use page size dropdown to change items per page (e.g., 10, 25, 50). 4. Actions: Click action buttons (e.g., 'View', 'Edit', 'Delete') in the Actions column of each row to perform actions on specific clip requests."
		},
		{
			"url": "http://localhost:8080/cliparchive/#/video-history",
			"features": "Clip Video History Page showing all generated video clips. User interactions: 1. Search clips: Locate the search input field (usually at the top of the page) and type a requester name (e.g., 'John') to search. Press Enter or click the search icon to execute the search. 2. Apply filters: Click the 'Filter' button or filter icon to open filter options. In the filter panel/modal, select filter criteria: choose requester name from dropdown or type in text input, select site name from dropdown, select date range using date pickers, select status from dropdown (e.g., completed, processing, failed). Click 'Apply' to filter results, or 'Reset' to clear filters. 3. View clip details: Click on any clip row or entry in the table/list to navigate to the clip detail page. Alternatively, click the 'View Details' button or icon in the Actions column. 4. Sort: Click column headers (Requester Name, Site Name, Creation Time, Status) to sort the list. 5. Pagination: Use page navigation controls at the bottom to browse through multiple pages of results."
		},
		{
			"url": "http://localhost:8080/cliparchive/#/video-detail/gjuwy-bjdeyy-xivbo",
			"features": "Video clip detail page showing comprehensive information about a specific clip. User interactions: 1. Video preview: Use video player controls to play, pause, seek through the footage. Click play button to start playback, drag the progress bar to jump to specific time, adjust volume using volume slider, use fullscreen button if available. 2. View metadata: Scroll to view clip metadata section showing site name, requester name, time range (from/to), status, creation date, etc. 3. View Log section: Scroll down to find the 'Log' section or tab. Click on the 'Log' tab or expand the Log section if it's collapsible. The Log section displays a table or list of action history. Look for entries showing 'download' and 'export' actions. Each log entry shows: action type (download/export), timestamp, and user information. User can scroll through log entries or use pagination if there are many entries. 4. Download clip: Click the 'Download' button (usually located near the top of the page or in an actions area). This may open a confirmation dialog - click 'Confirm' or 'Download' in the dialog to proceed. The file will download to the user's default download location. 5. Export clip: Click the 'Export' button (usually next to Download button). This may open an export modal. In the modal, select export format if options are available, optionally enter export settings, then click 'Export' or 'Confirm' button. The export action will be logged in the Log section."
		},
		{
			"url": "http://localhost:8080/cliparchive/#/remote-sites",
			"features": "Remote sites management page displaying all configured bus depot sites. User interactions: 1. View sites table: The page displays a table or list showing columns: Site Name (e.g., BUS1024), Connection Status (active/inactive with status indicators), Last Communication Time, and Pending Clip Requests Count. 2. Check site status: Look at the Connection Status column to see if a site is 'active' (green indicator) or 'inactive' (red/gray indicator). Status is displayed as text or colored badges. 3. View site details: Click on a site row or click the 'View Details' button/icon in the Actions column. This opens a site details modal or navigates to a detail page showing: site configuration, connection history, recent activity, etc. In the modal, click 'Close' or 'Back' to return to the list. 4. Search/filter sites: Use the search input field to type a site name (e.g., 'BUS1024') to filter the list. Or click filter icon to open filter options and filter by status (active/inactive), date range, etc. Click 'Apply' to filter. 5. Manage configurations: Click 'Edit' or 'Settings' button for a specific site to open configuration modal. In the modal, modify site settings (name, connection parameters, etc.), then click 'Save' to apply changes or 'Cancel' to discard. 6. Refresh status: Click 'Refresh' button to update the connection status and last communication time for all sites."
		},
		{
			"url": "http://localhost:8080/cliparchive/#/admin/health-notifications",
			"features": "Admin health notifications page for monitoring system health and alerts. User interactions: 1. View notifications: The page displays a list or table of notifications showing: notification type, severity level (critical, warning, info), message, timestamp, and status (unread/read, acknowledged/unacknowledged). Notifications are color-coded by severity (red for critical, yellow for warning, blue for info). 2. Filter notifications: Click the 'Filter' button or filter icon to open filter options. In the filter panel, select: severity level from dropdown or checkboxes (Critical, Warning, Info), notification type from dropdown (Site Connectivity, System Error, etc.), date range using date pickers, status (All, Unread, Read, Acknowledged). Click 'Apply Filters' to filter the list, or 'Clear' to reset. 3. Acknowledge notifications: Click the 'Acknowledge' button or checkmark icon for individual notifications, or select multiple notifications using checkboxes and click 'Acknowledge All' button. This marks notifications as acknowledged. A confirmation dialog may appear - click 'Confirm' to proceed. 4. View notification details: Click on a notification row or 'View Details' button to open a detail modal showing full notification message, related site information, error details, and suggested actions. Click 'Close' to dismiss the modal. 5. Mark as read: Click on unread notifications to mark them as read, or use 'Mark All as Read' button. 6. Delete notifications: Select notifications and click 'Delete' button, or click delete icon for individual notifications. Confirm deletion in the dialog that appears."
		},
		{
			"url": "http://localhost:8080/cliparchive/#/admin/settings",
			"features": "Admin settings page for system configuration. User interactions: 1. Navigate settings categories: The page displays tabs or a sidebar menu with categories: 'System Preferences', 'Notification Preferences', 'User Management', 'Security Settings', etc. Click on each tab or menu item to view and edit settings in that category. 2. Modify system preferences: In System Preferences section, locate settings like: default page size (dropdown), date format (dropdown), timezone (dropdown), language (dropdown). Change values by selecting from dropdowns or entering in text inputs. Toggle switches for boolean settings (e.g., enable/disable features). 3. Configure notification preferences: In Notification Preferences section, check/uncheck checkboxes for notification types (email alerts, in-app notifications, etc.), select notification frequency from dropdown (immediate, daily, weekly), enter email addresses in text inputs for notification recipients. 4. Manage users: In User Management section, click 'Add User' button to open user creation modal. In the modal, fill form fields: username (text input), email (text input), password (password input), role (dropdown: admin, user, viewer), permissions (checkboxes). Click 'Create User' to save or 'Cancel' to close. For existing users, click 'Edit' button to modify user details in a similar modal, or click 'Delete' button to remove users (confirm in dialog). 5. Save changes: After making any changes, scroll to the bottom of the page and click the 'Save' or 'Save Changes' button. A success message will appear confirming the save. If there are unsaved changes, a warning may appear when navigating away. Click 'Reset' or 'Cancel' to discard changes and revert to previous values."
		},
		{
			"url": "http://localhost:8080/cliparchive/#/invalid-page-to-check-not-found",
			"features": "404 Not Found error page displayed when accessing an invalid or non-existent route. User interactions: 1. View error message: The page displays a 404 error message (e.g., 'Page Not Found', '404 - The page you are looking for does not exist') along with a description. 2. Navigate back: Click the 'Go to Home' or 'Return to Dashboard' button to navigate back to the main page or dashboard. Alternatively, click the 'Back' button in the browser or use the application's navigation menu/logo to return to a valid page. 3. Search: If a search bar is available on the error page, type a page name or URL to search for the correct page. 4. Contact support: If a 'Contact Support' or 'Report Issue' link/button is present, click it to report the issue or get help."
		}
	],
	"persona": "You are an administrator at a bus depot. A bus was involved in an accident, and the police have requested the MVR (Mobile Video Recorder) footage that captured the incident. Your approach: First, check whether the BUS1024 site is currently active. Next, create a video clip from the BUS1024 site covering the time around November 18, 2025, at 1:30 PM. Finally, go to the details page for the generated clip and review the preview to verify if the accident was recorded.",
	"report": {
		"output": "./ux-report.md"
	}
}
